<a href="https://colab.research.google.com/github/hargettc2015/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/Copy_of_assignment_regression_classification_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 2, Sprint 1, Module 3*

---

# Ridge Regression

## Assignment

We're going back to our other **New York City** real estate dataset. Instead of predicting apartment rents, you'll predict property sales prices.

But not just for condos in Tribeca...

- [ ] Use a subset of the data where `BUILDING_CLASS_CATEGORY` == `'01 ONE FAMILY DWELLINGS'` and the sale price was more than 100 thousand and less than 2 million.
- [ ] Do train/test split. Use data from January â€”Â March 2019 to train. Use data from April 2019 to test.
- [ ] Do one-hot encoding of categorical features.
- [ ] Do feature selection with `SelectKBest`.
- [ ] Fit a ridge regression model with multiple features. Use the `normalize=True` parameter (or do [feature scaling](https://scikit-learn.org/stable/modules/preprocessing.html) beforehand â€”Â use the scaler's `fit_transform` method with the train set, and the scaler's `transform` method with the test set)
- [ ] Get mean absolute error for the test set.
- [ ] As always, commit your notebook to your fork of the GitHub repo.

The [NYC Department of Finance](https://www1.nyc.gov/site/finance/taxes/property-rolling-sales-data.page) has a glossary of property sales terms and NYC Building Class Code Descriptions. The data comes from the [NYC OpenData](https://data.cityofnewyork.us/browse?q=NYC%20calendar%20sales) portal.


## Stretch Goals

Don't worry, you aren't expected to do all these stretch goals! These are just ideas to consider and choose from.

- [ ] Add your own stretch goal(s) !
- [ ] Instead of `Ridge`, try `LinearRegression`. Depending on how many features you select, your errors will probably blow up! ðŸ’¥
- [ ] Instead of `Ridge`, try [`RidgeCV`](https://scikit-learn.org/stable/modules/generated/sklearn.linear_model.RidgeCV.html).
- [ ] Learn more about feature selection:
    - ["Permutation importance"](https://www.kaggle.com/dansbecker/permutation-importance)
    - [scikit-learn's User Guide for Feature Selection](https://scikit-learn.org/stable/modules/feature_selection.html)
    - [mlxtend](http://rasbt.github.io/mlxtend/) library
    - scikit-learn-contrib libraries: [boruta_py](https://github.com/scikit-learn-contrib/boruta_py) & [stability-selection](https://github.com/scikit-learn-contrib/stability-selection)
    - [_Feature Engineering and Selection_](http://www.feat.engineering/) by Kuhn & Johnson.
- [ ] Try [statsmodels](https://www.statsmodels.org/stable/index.html) if youâ€™re interested in more inferential statistical approach to linear regression and feature selection, looking at p values and 95% confidence intervals for the coefficients.
- [ ] Read [_An Introduction to Statistical Learning_](http://faculty.marshall.usc.edu/gareth-james/ISL/ISLR%20Seventh%20Printing.pdf), Chapters 1-3, for more math & theory, but in an accessible, readable way.
- [ ] Try [scikit-learn pipelines](https://scikit-learn.org/stable/modules/compose.html).

In [0]:
%%capture
import sys

# If you're on Colab:
if 'google.colab' in sys.modules:
    DATA_PATH = 'https://raw.githubusercontent.com/LambdaSchool/DS-Unit-2-Applied-Modeling/master/data/'
    !pip install category_encoders==2.*

# If you're working locally:
else:
    DATA_PATH = '../data/'
    
# Ignore this Numpy warning when using Plotly Express:
# FutureWarning: Method .ptp is deprecated and will be removed in a future version. Use numpy.ptp instead.
import warnings
warnings.filterwarnings(action='ignore', category=FutureWarning, module='numpy')

In [0]:
import pandas as pd
import pandas_profiling

# Read New York City property sales data
df = pd.read_csv(DATA_PATH+'condos/NYC_Citywide_Rolling_Calendar_Sales.csv')

# Change column names: replace spaces with underscores
df.columns = [col.replace(' ', '_') for col in df]

# SALE_PRICE was read as strings.
# Remove symbols, convert to integer
df['SALE_PRICE'] = (
    df['SALE_PRICE']
    .str.replace('$','')
    .str.replace('-','')
    .str.replace(',','')
    .astype(int)
)

In [0]:
# BOROUGH is a numeric column, but arguably should be a categorical feature,
# so convert it from a number to a string
df['BOROUGH'] = df['BOROUGH'].astype(str)

In [0]:
# Reduce cardinality for NEIGHBORHOOD feature

# Get a list of the top 10 neighborhoods
top10 = df['NEIGHBORHOOD'].value_counts()[:10].index

# At locations where the neighborhood is NOT in the top 10, 
# replace the neighborhood with 'OTHER'
df.loc[~df['NEIGHBORHOOD'].isin(top10), 'NEIGHBORHOOD'] = 'OTHER'

In [5]:
df.head()

  BOROUGH             NEIGHBORHOOD  ... SALE_PRICE   SALE_DATE
0       1                    OTHER  ...          0  01/01/2019
1       1                    OTHER  ...          0  01/01/2019
2       1                    OTHER  ...          0  01/01/2019
3       1                    OTHER  ...          0  01/01/2019
4       1  UPPER EAST SIDE (59-79)  ...          0  01/01/2019

[5 rows x 21 columns]

In [6]:
df[df.BUILDING_CLASS_CATEGORY == '01 ONE FAMILY DWELLINGS']

      BOROUGH NEIGHBORHOOD  ... SALE_PRICE   SALE_DATE
7           2        OTHER  ...          0  01/01/2019
8           2        OTHER  ...          0  01/01/2019
9           2        OTHER  ...          0  01/01/2019
42          3        OTHER  ...          0  01/01/2019
44          3        OTHER  ...     550000  01/01/2019
...       ...          ...  ...        ...         ...
23029       4        OTHER  ...     635000  04/30/2019
23031       4        OTHER  ...     514000  04/30/2019
23032       4        OTHER  ...     635000  04/30/2019
23033       4        OTHER  ...     545000  04/30/2019
23035       4        OTHER  ...     510000  04/30/2019

[5061 rows x 21 columns]

In [7]:
df.tail()

      BOROUGH NEIGHBORHOOD  ... SALE_PRICE   SALE_DATE
23035       4        OTHER  ...     510000  04/30/2019
23036       4        OTHER  ...     355000  04/30/2019
23037       4        OTHER  ...     375000  04/30/2019
23038       4        OTHER  ...    1100000  04/30/2019
23039       4        OTHER  ...     569202  04/30/2019

[5 rows x 21 columns]

In [8]:
df.drop(['EASE-MENT', 'ADDRESS', 'APARTMENT_NUMBER', 'NEIGHBORHOOD'], axis=1)

      BOROUGH            BUILDING_CLASS_CATEGORY  ... SALE_PRICE   SALE_DATE
0           1    13 CONDOS - ELEVATOR APARTMENTS  ...          0  01/01/2019
1           1                21 OFFICE BUILDINGS  ...          0  01/01/2019
2           1                21 OFFICE BUILDINGS  ...          0  01/01/2019
3           1    13 CONDOS - ELEVATOR APARTMENTS  ...          0  01/01/2019
4           1  15 CONDOS - 2-10 UNIT RESIDENTIAL  ...          0  01/01/2019
...       ...                                ...  ...        ...         ...
23035       4            01 ONE FAMILY DWELLINGS  ...     510000  04/30/2019
23036       4       09 COOPS - WALKUP APARTMENTS  ...     355000  04/30/2019
23037       4     10 COOPS - ELEVATOR APARTMENTS  ...     375000  04/30/2019
23038       4            02 TWO FAMILY DWELLINGS  ...    1100000  04/30/2019
23039       4      12 CONDOS - WALKUP APARTMENTS  ...     569202  04/30/2019

[23040 rows x 17 columns]

In [9]:
df = df[(df.SALE_PRICE >= 100000) & (df.SALE_PRICE <= 2000000)]
df.head()

   BOROUGH             NEIGHBORHOOD  ... SALE_PRICE   SALE_DATE
44       3                    OTHER  ...     550000  01/01/2019
61       4                    OTHER  ...     200000  01/01/2019
65       1                    OTHER  ...    2000000  01/02/2019
66       1                    OTHER  ...     330000  01/02/2019
67       1  UPPER EAST SIDE (79-96)  ...     600000  01/02/2019

[5 rows x 21 columns]

In [0]:
df['SALE_DATE'] = pd.to_datetime(df['SALE_DATE'], infer_datetime_format=True)
cutoff = pd.to_datetime('2019-04-01')
train = (df[df['SALE_DATE'] < cutoff])
test  = (df[df['SALE_DATE'] >= cutoff])

In [0]:
import numpy as np
import pandas as pd
import sys
from sklearn.linear_model import LinearRegression
import matplotlib.pyplot as plt
import datetime
from datetime import date
from datetime import time
from datetime import datetime

In [12]:
train.shape

(10488, 21)

In [13]:
test.shape

(2983, 21)

In [14]:
train.select_dtypes(include='number').describe().T

                             count           mean  ...        75%        max
BLOCK                      10488.0    4634.901506  ...    6793.00    16350.0
LOT                        10488.0     336.372235  ...     271.00     9002.0
EASE-MENT                      0.0            NaN  ...        NaN        NaN
ZIP_CODE                   10488.0   10820.087719  ...   11364.00    11697.0
RESIDENTIAL_UNITS          10488.0       1.160278  ...       2.00      155.0
COMMERCIAL_UNITS           10488.0       0.137586  ...       0.00       50.0
TOTAL_UNITS                10488.0       1.486175  ...       2.00      156.0
GROSS_SQUARE_FEET          10488.0    1596.800057  ...    1869.00   244619.0
YEAR_BUILT                 10483.0    1838.956883  ...    1965.00     2018.0
TAX_CLASS_AT_TIME_OF_SALE  10488.0       1.572654  ...       2.00        4.0
SALE_PRICE                 10488.0  709836.276697  ...  901363.25  2000000.0

[11 rows x 8 columns]

In [15]:
train.describe(exclude='number').T.sort_values(by='unique')

                                count unique  ...      first       last
BOROUGH                         10488      5  ...        NaT        NaT
TAX_CLASS_AT_PRESENT            10488     10  ...        NaT        NaT
NEIGHBORHOOD                    10488     11  ...        NaT        NaT
BUILDING_CLASS_CATEGORY         10488     40  ...        NaT        NaT
SALE_DATE                       10488     80  ... 2019-01-01 2019-03-30
BUILDING_CLASS_AT_PRESENT       10488     96  ...        NaT        NaT
BUILDING_CLASS_AT_TIME_OF_SALE  10488     96  ...        NaT        NaT
APARTMENT_NUMBER                 2146    827  ...        NaT        NaT
LAND_SQUARE_FEET                10463   2004  ...        NaT        NaT
ADDRESS                         10488  10442  ...        NaT        NaT

[10 rows x 6 columns]

In [16]:
train['GROSS_SQUARE_FEET'].value_counts()

0.0       3120
1440.0      64
1600.0      50
1200.0      45
1800.0      44
          ...
6080.0       1
3085.0       1
1906.0       1
4600.0       1
2567.0       1
Name: GROSS_SQUARE_FEET, Length: 2251, dtype: int64

In [17]:
train.groupby('GROSS_SQUARE_FEET')['SALE_PRICE'].mean()

GROSS_SQUARE_FEET
0.0         5.788181e+05
2.0         7.400000e+05
80.0        6.300000e+05
112.0       2.400000e+05
135.0       5.850000e+05
                ...
194030.0    5.740000e+05
217991.0    3.054750e+05
224400.0    1.989588e+06
231379.0    1.731025e+06
244619.0    4.800000e+05
Name: SALE_PRICE, Length: 2251, dtype: float64

In [0]:
target = 'SALE_PRICE'
high_card = ['BUILDING_CLASS_CATEGORY', 'NEIGHBORHOOD', 'BLOCK', 'LOT', 'EASE-MENT',
             'BUILDING_CLASS_AT_PRESENT', 'ADDRESS', 'APARTMENT_NUMBER', 'ZIP_CODE',
             'LAND_SQUARE_FEET', 'GROSS_SQUARE_FEET', 'YEAR_BUILT', 'BUILDING_CLASS_AT_TIME_OF_SALE',
             'SALE_DATE']
features = train.columns.drop([target] + high_card)

In [0]:
X_train = train[features]
y_train = train[target]
X_test = test[features]
y_test = test[target]

In [20]:
X_train

      BOROUGH TAX_CLASS_AT_PRESENT  ...  TOTAL_UNITS  TAX_CLASS_AT_TIME_OF_SALE
44          3                    1  ...          1.0                          1
61          4                    1  ...          1.0                          1
65          1                    2  ...          1.0                          2
66          1                    2  ...          0.0                          2
67          1                    2  ...          0.0                          2
...       ...                  ...  ...          ...                        ...
18132       5                    1  ...          1.0                          1
18134       5                    1  ...          1.0                          1
18138       5                    1  ...          2.0                          1
18144       2                    1  ...          2.0                          1
18147       4                    1  ...          1.0                          1

[10488 rows x 6 columns]

In [0]:
import category_encoders as ce
encoder = ce.OneHotEncoder(use_cat_names=True)
X_train = encoder.fit_transform(X_train)

In [0]:
X_test = encoder.transform(X_test)

In [23]:
X_train

       BOROUGH_3  BOROUGH_4  ...  TOTAL_UNITS  TAX_CLASS_AT_TIME_OF_SALE
44             1          0  ...          1.0                          1
61             0          1  ...          1.0                          1
65             0          0  ...          1.0                          2
66             0          0  ...          0.0                          2
67             0          0  ...          0.0                          2
...          ...        ...  ...          ...                        ...
18132          0          0  ...          1.0                          1
18134          0          0  ...          1.0                          1
18138          0          0  ...          2.0                          1
18144          0          0  ...          2.0                          1
18147          0          1  ...          1.0                          1

[10488 rows x 19 columns]

In [24]:
X_test

       BOROUGH_3  BOROUGH_4  ...  TOTAL_UNITS  TAX_CLASS_AT_TIME_OF_SALE
18167          0          0  ...          1.0                          2
18170          0          0  ...          0.0                          2
18173          0          0  ...          1.0                          2
18174          0          0  ...          0.0                          2
18175          0          0  ...          1.0                          2
...          ...        ...  ...          ...                        ...
23035          0          1  ...          1.0                          1
23036          0          1  ...          0.0                          2
23037          0          1  ...          0.0                          2
23038          0          1  ...          3.0                          1
23039          0          1  ...         85.0                          2

[2983 rows x 19 columns]

In [25]:
from sklearn.feature_selection import SelectKBest, f_regression
selector = SelectKBest(score_func=f_regression, k=15)
X_train_selected = selector.fit_transform(X_train, y_train)
X_test_selected = selector.transform(X_test)
X_train_selected.shape, X_test_selected.shape

((10488, 15), (2983, 15))

In [26]:
all_names = X_train.columns
selected_mask = selector.get_support()
selected_names = all_names[selected_mask]
unselected_names = all_names[~selected_mask]

print('Features selected:')
for name in selected_names:
    print(name)

print('\n')
print('Features not selected:')
for name in unselected_names:
    print(name)

Features selected:
BOROUGH_3
BOROUGH_4
BOROUGH_1
BOROUGH_2
BOROUGH_5
TAX_CLASS_AT_PRESENT_2
TAX_CLASS_AT_PRESENT_4
TAX_CLASS_AT_PRESENT_2A
TAX_CLASS_AT_PRESENT_1A
TAX_CLASS_AT_PRESENT_2C
TAX_CLASS_AT_PRESENT_2B
TAX_CLASS_AT_PRESENT_1D
RESIDENTIAL_UNITS
TOTAL_UNITS
TAX_CLASS_AT_TIME_OF_SALE


Features not selected:
TAX_CLASS_AT_PRESENT_1
TAX_CLASS_AT_PRESENT_1B
TAX_CLASS_AT_PRESENT_1C
COMMERCIAL_UNITS

In [27]:
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_absolute_error

for k in range(1, len(X_train.columns)+1):
    print(f'{k} features')

    selector = SelectKBest(score_func=f_regression, k=k)
    X_train_selected = selector.fit_transform(X_train, y_train)
    X_test_selected = selector.transform(X_test)

    model = LinearRegression()
    model.fit(X_train_selected, y_train)
    y_pred = model.predict(X_test_selected)

    mae = mean_absolute_error(y_test, y_pred)
    print(f'Test MAE: ${mae:,.0f} \n')

1 features
Test MAE: $321,301

2 features
Test MAE: $317,743

3 features
Test MAE: $307,936

4 features
Test MAE: $308,422

5 features
Test MAE: $306,029

6 features
Test MAE: $305,902

7 features
Test MAE: $286,802

8 features
Test MAE: $286,503

9 features
Test MAE: $286,214

10 features
Test MAE: $285,747

11 features
Test MAE: $285,637

12 features
Test MAE: $285,567

13 features
Test MAE: $285,576

14 features
Test MAE: $284,799

15 features
Test MAE: $284,799

16 features
Test MAE: $284,706

17 features
Test MAE: $284,683

18 features
Test MAE: $284,640

19 features
Test MAE: $284,640